Autodesk.Revit.DB.AssemblyViewUtils.CreateDetailSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.AssemblyDetailViewOrientation,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new detail section assembly view for the assembly instance.
Remarks:
The detail section will cut through the center of the assembly instance's outline.
The document must be regenerated before using the detail section.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
direction:
The direction for the new view.
viewTemplateId:
Id of the view template that is used to create the view; if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned; if false, the template will be applied.
Returns:
A new detail section assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the view that is about to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017

Autodesk.Revit.DB.AssemblyViewUtils.Create3DOrthographic(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new orthographic 3D assembly view for the assembly instance.
The view will have the same orientation as the Default 3D view.
The document must be regenerated before using the 3D view.
document:
The document to which the view will be added.
assemblyInstanceId:
Id of the assembly instance that owns the new view.
viewTemplateId:
Id of the view template that is used to create the view;
if invalidElementId, the view will be created with the default settings.
isAssigned:
If true, the template will be assigned, if false, the template will be applied.
Returns:
A new orthographic 3D assembly view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
assemblyInstanceId is not an AssemblyInstance.
-or-
viewTemplateId is not a correct view template for the view that is about to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017